# 01. Importing libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

# 02. Data types

In [2]:
path = r'C:\Users\Kozole\Desktop\CF Kurs\Excercise\6\World University Rankings'

In [3]:
df_uni = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'cwurData.csv'), index_col = False)

In [4]:
df_uni.shape

(2200, 14)

# 03. Task 6.1

In [5]:
# Checking the top 5 rows

df_uni.head(5)

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

In [6]:
# Check for mixed-type data  

for col in df_uni.columns.tolist():
  weird = (df_uni[[col]].applymap(type) != df_uni[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_uni[weird]) > 0:
    print (col)

In [7]:
# There are no mixed-type data

In [8]:
# Checking for missing values

df_uni.isnull().sum()

world_rank                0
institution               0
country                   0
national_rank             0
quality_of_education      0
alumni_employment         0
quality_of_faculty        0
publications              0
influence                 0
citations                 0
broad_impact            200
patents                   0
score                     0
year                      0
dtype: int64

In [9]:
# There are 200 missing values in column broad_impact

In [10]:
# Dropping column broad_impact as it is not a factor in the calculation the overall score for the 
# Universities and is not needed for the analysis

df_uni_1 = df_uni.drop(columns = ['broad_impact'])

In [11]:
# Checking for missing values

df_uni_1.isnull().sum()

world_rank              0
institution             0
country                 0
national_rank           0
quality_of_education    0
alumni_employment       0
quality_of_faculty      0
publications            0
influence               0
citations               0
patents                 0
score                   0
year                    0
dtype: int64

In [12]:
df_uni_1.shape

(2200, 13)

In [13]:
# Column broad_impact is dropped

In [14]:
# Checking for duplicated values

df_dups = df_uni_1[df_uni_1.duplicated()]

In [15]:
df_dups

Empty DataFrame
Columns: [world_rank, institution, country, national_rank, quality_of_education, alumni_employment, quality_of_faculty, publications, influence, citations, patents, score, year]
Index: []

In [16]:
df_dups.shape

(0, 13)

In [17]:
# The data set does not contain duplicated values

In [18]:
#df_uni_1 statistical analysis

df_uni_1.describe()

,world_rank,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,patents,score,year
count,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000,2200.000000
mean,459.590909,40.278182,275.100455,357.116818,178.888182,459.908636,459.797727,413.417273,433.346364,47.798395,2014.318182
std,304.320363,51.740870,121.935100,186.779252,64.050885,303.760352,303.331822,264.366549,273.996525,7.760806,0.762130
min,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,43.360000,2012.000000
25%,175.750000,6.000000,175.750000,175.750000,175.750000,175.750000,175.750000,161.000000,170.750000,44.460000,2014.000000
50%,450.500000,21.000000,355.000000,450.500000,210.000000,450.500000,450.500000,406.000000,426.000000,45.100000,2014.000000
75%,725.250000,49.000000,367.000000,478.000000,218.000000,725.000000,725.250000,645.000000,714.250000,47.545000,2015.000000
max,1000.000000,229.000000,367.000000,567.000000,218.000000,1000.000000,991.000000,812.000000,871.000000,100.000000,2015.000000

In [19]:
#Exporting df_uni_1 as cwurData_1.csv

df_uni_1.to_csv(os.path.join(path, '02 Data','Prepared Data', 'cwurData_1.csv'))

In [20]:
df_uni_1.shape

(2200, 13)